---
kind: method
id: M:Autodesk.Revit.DB.DocumentDifference.GetModifiedElementIds
source: html/ea9a9eb3-506c-ee93-69a3-8a8c4489b0f8.htm
---
# Autodesk.Revit.DB.DocumentDifference.GetModifiedElementIds Method

Modified element id collection.

## Syntax (C#)
```csharp
public ISet<ElementId> GetModifiedElementIds()
```